# ============================================
# config.py
# 대시보드 전체에서 공통으로 사용할 확정 설정값
# ============================================


# --------------------------------------------
# 1. 기본 컬럼명
# --------------------------------------------

BATCH_COL = "배치번호"
STRATEGY_COL = "제어전략그룹"
TIME_COL = "발효시간"

P_COL = "페니실린농도_P"
FAULT_POINT_COL = "결함라벨_구간"
FAULT_BATCH_COL = "결함라벨_배치"


# --------------------------------------------
# 2. 최종 Golden Batch
# --------------------------------------------

GOLDEN_BATCHES = {
    "RC": [8, 12, 14, 16, 17, 26],
    "OC": [35, 48, 57],
    "APC": [62, 65, 68, 79, 82, 85],
}


# --------------------------------------------
# 3. 고정 Test Batch
# --------------------------------------------

TEST_NORMAL_BATCHES = [
    1, 5, 11, 13, 19, 23,
    31, 32, 34, 40, 45, 46, 54,
    71, 74, 77, 78, 81, 84
]

TEST_FAULT_BATCHES = [91]

TEST_BATCHES = TEST_NORMAL_BATCHES + TEST_FAULT_BATCHES


# --------------------------------------------
# 4. 전략별 평균 운전시간
# Replay 진행률 계산용
# --------------------------------------------

STRATEGY_MEAN_DURATION = {
    "RC": 232.125,
    "OC": 226.739,
    "APC": 225.458,
}

OVERALL_MEAN_DURATION = 228.127

# --------------------------------------------
# 5. Fault Batch의 Golden 비교 기준
# --------------------------------------------

FAULT_COMPARISON_STRATEGY = {
    91: "APC"
}

# --------------------------------------------
# Golden Profile용 변수 12개
# --------------------------------------------

GOLDEN_CONTINUOUS_COLS = [
    "페니실린농도_P",
    "기질농도_S",
    "용존산소_DO2",
    "pH",
    "발효온도_T",
    "산소소비율_OUR",
    "염기투입유량_Fb",
    "냉난방수유량_Fc",
]

GOLDEN_STEP_COLS = [
    "공기주입유량_Fg",
    "당공급유량_Fs",
    "산투입유량_Fa",
    "PAA투입유량_Fpaa",
]

# --------------------------------------------
# 최종 SMAPE 이탈진단 변수 11개
# Golden Profile 12개와 구분해서 사용
# --------------------------------------------

SMAPE_COLS = [
    "pH",
    "발효온도_T",
    "용존산소_DO2",
    "염기투입유량_Fb",
    "냉난방수유량_Fc",
    "산소소비율_OUR",
    "공기주입유량_Fg",
    "당공급유량_Fs",
    "산투입유량_Fa",
    "페니실린농도_P",
    "PAA투입유량_Fpaa",
]